benchmarks/multi-thread-tokio.txt
Running 30s test @ http://127.0.0.1:7878
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.70ms    2.52ms  15.27ms   93.14%
    Req/Sec   421.04    470.85     1.24k    70.83%
  3056 requests in 30.09s, 664.30KB read
  Socket errors: connect 0, read 3055, write 0, timeout 505
  Non-2xx or 3xx responses: 627
Requests/sec:    101.58
Transfer/sec:     22.08KB