benchmarks/single-thread-tokio.txt
Running 30s test @ http://127.0.0.1:7878
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.77ms    2.21ms  13.54ms   90.12%
    Req/Sec   413.39    441.48     1.11k    70.73%
  2869 requests in 30.08s, 623.73KB read
  Socket errors: connect 0, read 2869, write 0, timeout 501
  Non-2xx or 3xx responses: 591
Requests/sec:     95.39
Transfer/sec:     20.74KB